mdhardenburgh/Blinky/Packages/.cache/NXP.MK22F25612_DFP.12.0.0.pdsc
    <condition id="device.MK22F25612_AND_driver.edma">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK22F25612_AND_driver.common">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK22F25612_AND_component.lists_AND_driver.common">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="driver.lpuart_OR_driver.uart">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MK22F25612_AND_driver.lpuart_OR_driver.uart">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require condition="driver.lpuart_OR_driver.uart"/>
    </condition>
    <condition id="device.MK22F25612_AND_driver.common_AND_driver.uart">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MK22F25612_AND_CMSIS_Include_core_cm4">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="device.MK22F25612_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.dspi_edma">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK22F25612_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.i2c_edma">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK22F25612_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.lpuart_edma">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK22F25612_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.uart_edma">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK22F25612_AND_device.MK22F25612_CMSIS_AND_driver.clock">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MK22F25612_startup"/>
    </condition>
    <condition id="device.MK22F25612_AND_driver.dspi_AND_driver.edma">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK22F25612_AND_driver.common_AND_driver.dmamux">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK22F25612_AND_driver.edma_AND_driver.i2c">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK22F25612_AND_driver.edma_AND_driver.lpuart">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="device.MK22F25612_AND_driver.edma_AND_driver.sai">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai"/>
    </condition>
    <condition id="device.MK22F25612_AND_driver.edma_AND_driver.uart">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
