mdhardenburgh/Blinky/Packages/.cache/NXP.MK22F25612_DFP.12.0.0.pdsc
    <condition id="device.MK22F25612_AND_utility.debug_console">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MK22F25612_AND_component.serial_manager_AND_driver.common">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK22F25612_AND_component.lists_AND_driver.common_AND_utility.debug_console">
      <accept Dname="MK22FN128???12*" Dvendor="NXP:11"/>
      <accept Dname="MK22FN256???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MK22F25612" Cversion="1.0.0" condition="device.MK22F25612_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MK22F25612_startup_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.port_AND_driver.smc_AND_driver.uart_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.MK22F25612_AND_driver.edma">
      <description/>
      <files>
        <file category="header" attr="config" name="template/RTE_Device.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lists" Cversion="1.0.0" condition="device.MK22F25612_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/lists/generic_list.c"/>
        <file category="header" name="components/lists/generic_list.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.0" condition="device.MK22F25612_AND_component.lists_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_manager.c"/>
        <file category="header" name="components/serial_manager/serial_manager.h"/>
        <file category="header" name="components/serial_manager/serial_port_internal.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="device.MK22F25612_AND_driver.lpuart_OR_driver.uart">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_port_uart.c"/>
        <file category="header" name="components/serial_manager/serial_port_uart.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="uart_adapter" Cversion="1.0.0" condition="device.MK22F25612_AND_driver.common_AND_driver.uart">
      <description/>
      <files>
        <file category="header" name="components/uart/uart.h"/>
        <file category="sourceC" name="components/uart/uart_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="MK22F25612_startup" Cversion="1.0.0" condition="device.MK22F25612_AND_CMSIS_Include_core_cm4">
      <description/>
      <files>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MK22F25612.s"/>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MK22F25612.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MK22FN128xxx12_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MK22FN128xxx12_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MK22FN256xxx12_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MK22FN256xxx12_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MK22FN128xxx12_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MK22FN128xxx12_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MK22FN256xxx12_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MK22FN256xxx12_ram.icf"/>
        <file category="header" attr="config" name="MK22F25612.h"/>
        <file category="header" attr="config" name="MK22F25612_features.h"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="sourceC" attr="config" name="system_MK22F25612.c"/>
        <file category="header" attr="config" name="system_MK22F25612.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.0.2" condition="device.MK22F25612_AND_driver.common">
      <description>ADC16 Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc16.c"/>
        <file category="header" name="drivers/fsl_adc16.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.0" condition="device.MK22F25612_AND_driver.common">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
        <file category="header" name="drivers/fsl_clock.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmp" Cversion="2.0.1" condition="device.MK22F25612_AND_driver.common">
      <description>CMP Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_cmp.c"/>
        <file category="header" name="drivers/fsl_cmp.h"/>
      </files>
    </component>
